; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 768559 1 1 3 3 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	image2 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(have_image Star3 spectrograph1)
	(have_image Phenomenon4 thermograph0)
	(have_image Phenomenon5 spectrograph1)
	(have_image Phenomenon6 image2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 star3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star3)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation1 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 star3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star3)
   goals met: 0 of 5
6. (take_image satellite0 star3 instrument0 spectrograph1)
   added: (have_image star3 spectrograph1)
   goals met: 1 of 5
7. (turn_to satellite0 phenomenon6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 5
8. (take_image satellite0 phenomenon6 instrument0 image2)
   added: (have_image phenomenon6 image2)
   goals met: 3 of 5
9. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 5
10. (take_image satellite0 phenomenon5 instrument0 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 3 of 5
11. (turn_to satellite0 phenomenon6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 5
12. (turn_to satellite0 phenomenon4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon4)
   goals met: 3 of 5
13. (take_image satellite0 phenomenon4 instrument0 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 4 of 5
14. (turn_to satellite0 phenomenon6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 5
